In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [3]:
df = pd.read_csv('scanner_data.csv')

In [4]:
df.head()

,Unnamed: 0,Date,Customer_ID,Transaction_ID,SKU_Category,SKU,Quantity,Sales_Amount
0,1,2/1/2016,2547,1,X52,0EM7L,1.0,3.13
1,2,2/1/2016,822,2,2ML,68BRQ,1.0,5.46
2,3,2/1/2016,3686,3,0H2,CZUZX,1.0,6.35
3,4,2/1/2016,3719,4,0H2,549KK,1.0,5.59
4,5,2/1/2016,9200,5,0H2,K8EHH,1.0,6.88

In [5]:
del df['Unnamed: 0']

In [6]:
df.head()

,Date,Customer_ID,Transaction_ID,SKU_Category,SKU,Quantity,Sales_Amount
0,2/1/2016,2547,1,X52,0EM7L,1.0,3.13
1,2/1/2016,822,2,2ML,68BRQ,1.0,5.46
2,2/1/2016,3686,3,0H2,CZUZX,1.0,6.35
3,2/1/2016,3719,4,0H2,549KK,1.0,5.59
4,2/1/2016,9200,5,0H2,K8EHH,1.0,6.88

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 131706 entries, 0 to 131705
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Date            131706 non-null  object
 1   Customer_ID     131706 non-null  int64
 2   Transaction_ID  131706 non-null  int64
 3   SKU_Category    131706 non-null  object
 4   SKU             131706 non-null  object
 5   Quantity        131706 non-null  float64
 6   Sales_Amount    131706 non-null  float64
dtypes: float64(2), int64(2), object(3)
memory usage: 7.0+ MB

In [9]:
# Convert the date column to datetime

df['Date'] = pd.to_datetime(df['Date'])

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 131706 entries, 0 to 131705
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Date            131706 non-null  datetime64[ns]
 1   Customer_ID     131706 non-null  int64
 2   Transaction_ID  131706 non-null  int64
 3   SKU_Category    131706 non-null  object
 4   SKU             131706 non-null  object
 5   Quantity        131706 non-null  float64
 6   Sales_Amount    131706 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 7.0+ MB

In [12]:
# format date colum to mm/dd/yyyy

df['Date'] = df['Date'].dt.strftime('%m/%d/%Y')

In [16]:
df.Date.value_counts()

09/23/2016    638
12/15/2016    614
09/22/2016    606
05/13/2016    602
12/16/2016    594
             ...
07/31/2016    128
03/01/2016    111
08/28/2016    107
12/24/2016    100
03/28/2016     73
Name: Date, Length: 363, dtype: int64

In [17]:
df.to_csv('scanner.csv', index=False)